---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceMatchOptions.Dispose
source: html/27422e0e-aa91-e601-ad55-03aa48f1ea98.htm
---
# Autodesk.Revit.DB.ExternalResourceMatchOptions.Dispose Method

Releases all resources used by the ExternalResourceMatchOptions

## Syntax (C#)
```csharp
public void Dispose()
```